Tekla Open API Reference for Tekla Structures 2025
ShapeItem.SetHandlePoints Method
 Set the Shape item's Handle Points
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetHandlePoints(
	List<Point> HandlePoints
)
Public Function SetHandlePoints (
	HandlePoints As List(Of Point)
) As Boolean
Parameters
HandlePoints
Type: System.Collections.Generic.List<Point>
The handle points.
Return Value
Type: Boolean
True if success or False
Examples
public void SetHandlePointsTest()
{
    var polymesh = CreateSomeValidBrep();
    var shapeItem = new ShapeItem
    {
        Name = "TestFileName",
        ShapeFacetedBrep = polymesh,
        UpAxis = ShapeUpAxis.Z_Axis
    };
    shapeItem.Insert();
    var handlePoints = new List<Point>;
        {
          new Point(100.0, 100.0, 100.0),
          new Point(-100.0, -100.0, -100.0),
        };
   shapeItem.SetHandlePoints(handlePoints);
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace